Эта абстракция, такая Абстракция... даже на вопрос:
"— А можно более конкретный пример?"
ответом:
"— Ок. Допустим, что у каждого фреймворка есть свой уникальный интерфейс «список», вот как это может выглядеть:" 
Бла-бла-класс-объект-бла-фреймворк-интерфейс-бла-бла-конструктор-бла-пример_использования
"— Больше всего понравился пример использования. Очень компактно и понятно."
Seriously??? дануна!
конкретный пример это:      //взято из не_вашего ролика на youtube ниже (можно уже и свои заливать)

есть Interface "розетка"
у него есть методы:
void connect();