{//парамтры паттерна для SimpleDateFormat
G		н.э.	эра (в английской локализации - AD и BC)
y		2012	год (4-х значное число)
yy		12		год (последние 2 цифры)
yyyy	2012	год (4-х значное число)
M		2		номер месяца без лидирующих нулей
MM		02		номер месяца (с лидирующими нулями если номер месяца < 10)
MMM		фев		четырех буквенное сокращение месяца в русской локализации и трех буквенное - в английской (Feb)
MMMM	Февраль	полное название месяца (в английской локализации - February)
w		7		неделя в году без лидирующих нулей
ww		07		неделя в году с лидирующими нулями
W		2		неделя в месяце без лидирующих нулей
WW		02		неделя в месяце с лидирующим нулем (если это необходимо)
D		38		день в году
d		7		день месяца без лидирующих нулей
dd		07		день месяца с лидирующими нулями
F		1		день недели в месяце без лидирующих нулей
FF		01		день недели в месяце с лидирующими нулями
E		Вт		день недели (сокращение)
EEEE	вторник	день недели (полностью)
a		AM		AM/PM указатель
H		6		часы в 24-часовом формате без лидирующих нулей
HH		06		часы в 24-часовом формате с лидирующим нулем
k		18		количество часов в 24-часовом формате
K		6		количество часов в 12-часовом формате
h		6		время в 12-часовом формате без лидирующих нулей
hh		06		время в 12-часовом формате с лидирующим нулем
m		32		минуты без лидирующих нулей
mm		32		минуты с лидирующим нулем
s		11		секунды без лидирующих нулей
ss		11		секунды с лидирующим нулем
S		109		миллисекунды
z		EET		часовой пояс
Z		+0200	часовой пояс в формате RFC 822
'		'Date='	символ экранирования для текста
''	'o''clock'	кавычка			}
